[
  {
    "title": "Seeing the Unseen: Towards Zero-Shot Inspection forWindTurbineBladesusing Knowledge-Augmented Vision Language Models",
    "abstract": "Abstract:Wind…▽ MoreWindturbinebladesoperate in harsh environments, making timely damagedetectionessential for preventing failures and optimizing maintenance. Drone-based inspection and deep learning are promising, but typically depend on large, labeled datasets, which limit their ability todetectrare or evolving damage types. To address this, we propose a zero-shot-oriented inspection framework that integrates Retrieval-Augmented Generation (RAG) with Vision-Language Models (VLM). A multimodal knowledge base is constructed, comprising technical documentation, representative reference images, and domain-specific guidelines. A hybrid text-image retriever with keyword-aware reranking assembles the most relevant context to condition the VLM at inference, injecting domain knowledge without task-specific training. We evaluate the framework on 30 labeledbladeimages covering diverse damage categories. Although the dataset is small due to the difficulty of acquiring verifiedbladeimagery, it covers multiple representativedefecttypes. On this test set, the RAG-grounded VLM correctly classified all samples, whereas the same VLM without retrieval performed worse in both accuracy and precision. We further compare against open-vocabulary baselines and incorporate uncertainty Clopper-Pearson confidence intervals to account for the small-sample setting. Ablation studies indicate that the key advantage of the framework lies in explainability and generalizability: retrieved references ground the reasoning process and enable thedetectionof previously unseendefectsby leveraging domain knowledge rather than relying solely on visual cues. This research contributes a data-efficient solution for industrial inspection that reduces dependence on extensive labeled datasets.△ Less",
    "url": "https://arxiv.org/abs/2510.22868"
  },
  {
    "title": "Non-contact Sensing for AnomalyDetectioninWindTurbineBlades: A focus-SVDD with Complex-Valued Auto-Encoder Approach",
    "abstract": "Abstract:The occurrence of manufacturingdefectsin…▽ MoreThe occurrence of manufacturingdefectsinwindturbineblade(WTB) production can result in significant increases in operation and maintenance costs and lead to severe and disastrous consequences. Therefore, inspection during the manufacturing process is crucial to ensure consistent fabrication of composite materials. Non-contact sensing techniques, such as Frequency Modulated Continuous Wave (FMCW) radar, are becoming increasingly popular as they offer a full view of these complex structures during curing. In this paper, we enhance the quality assurance of manufacturing utilizing FMCW radar as a non-destructive sensing modality. Additionally, a novel anomalydetectionpipeline is developed that offers the following advantages: (1) We use the analytic representation of the Intermediate Frequency signal of the FMCW radar as a feature to disentangle material-specific and round-trip delay information from the received wave. (2) We propose a novel anomalydetectionmethodology called focus Support Vector Data Description (focus-SVDD). This methodology involves defining the limit boundaries of the dataset after removing healthy data features, thereby focusing on the attributes of anomalies. (3) The proposed method employs a complex-valued autoencoder to remove healthy features and we introduces a new activation function called Exponential Amplitude Decay (EAD). EAD takes advantage of the Rayleigh distribution, which characterizes an instantaneous amplitude signal. The effectiveness of the proposed method is demonstrated through its application to collected data, where it shows superior performance compared to other state-of-the-art unsupervised anomalydetectionmethods. This method is expected to make a significant contribution not only to structural health monitoring but also to the field of deep complex-valued data processing and SVDD application.△ Less",
    "url": "https://arxiv.org/abs/2306.10808"
  },
  {
    "title": "Next-generation perception system for automateddefectsdetectionin composite laminates via polarized computational imaging",
    "abstract": "Abstract:Finishing operations on large-scale composite components likewind…▽ MoreFinishing operations on large-scale composite components likewindturbineblades, including trimming and sanding, often require multiple workers and part repositioning. In the composites manufacturing industry, automation of such processes is challenging, as manufactured part geometry may be inconsistent and task completion is based on human judgment and experience. Implementing a mobile, collaborative robotic system capable of performing finishing tasks in dynamic and uncertain environments would improve quality and lower manufacturing costs. To complete the given tasks, the collaborative robotic team must properly understand the environment anddetectirregularities in the manufactured parts. In this paper, we describe the initial implementation and demonstration of a polarized computational imaging system to identifydefectsin composite laminates. As the polarimetric images are highly relevant to the surface micro-geometry, they can be used todetectsurfacedefectsthat are not visible in conventional color images. The proposed vision system successfully identifiesdefecttypes and surface characteristics (e.g., pinholes, voids, scratches, resin flash) for different glass fiber and carbon fiber laminates.△ Less",
    "url": "https://arxiv.org/abs/2108.10819"
  },
  {
    "title": "Barely-Visible Surface CrackDetectionforWindTurbineSustainability",
    "abstract": "Abstract:The production ofwindenergy is a crucial part of sustainable development and reducing the reliance on fossil fuels. Maintaining the integrity of…▽ MoreThe production ofwindenergy is a crucial part of sustainable development and reducing the reliance on fossil fuels. Maintaining the integrity ofwindturbinesto produce this energy is a costly and time-consuming task requiring repeated inspection and maintenance. While autonomous drones have proven to make this process more efficient, the algorithms fordetectinganomalies to prevent catastrophic damage toturbinebladeshave fallen behind due to some dangerousdefects, such as hairline cracks, being barely-visible. Existing datasets and literature are lacking and tend towardsdetectingobvious and visibledefectsin addition to not being geographically diverse. In this paper we introduce a novel and diverse dataset of barely-visible hairline cracks collected from numerouswindturbineinspections. To prove the efficacy of our dataset, we detail our end-to-end deployedturbinecrackdetectionpipeline from the image acquisition stage to the use of predictions in providing automated maintenance recommendations to extend the life and efficiency ofwindturbines.△ Less",
    "url": "https://arxiv.org/abs/2407.07186"
  },
  {
    "title": "A Novel Approach forDefectDetectionofWindTurbineBladeUsing Virtual Reality and Deep Learning",
    "abstract": "Abstract:Wind…▽ MoreWindturbinesare subjected to continuous rotational stresses and unusual external forces such as storms, lightning, strikes by flying objects, etc., which may causedefectsinturbineblades. Hence, it requires a periodical inspection to ensure proper functionality and avoid catastrophic failure. The task of inspection is challenging due to the remote location and inconvenient reachability by human inspection. Researchers used images with croppeddefectsfrom thewindturbinein the literature. They neglected possible background biases, which may hinder real-time and autonomousdefectdetectionusing aerial vehicles such as drones or others. To overcome such challenges, in this paper, we experiment withdefectdetectionaccuracy by having thedefectswith the background using a two-step deep-learning methodology. In the first step, we develop virtual models ofwindturbinesto synthesize the near-reality images for four types of commondefects- cracks, leading edge erosion, bending, and light striking damage. The Unity perception package is used to generatewindturbinebladedefectsimages with variations in background, randomness, camera angle, and light effects. In the second step, a customized U-Net architecture is trained to classify and segment thedefectinturbineblades. The outcomes of U-Net architecture have been thoroughly tested and compared with 5-fold validation datasets. The proposed methodology provides reasonabledefectdetectionaccuracy, making it suitable for autonomous and remote inspection through aerial vehicles.△ Less",
    "url": "https://arxiv.org/abs/2401.00237"
  }
]